---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d
source: html/f57a4635-bc7f-0aa9-3182-bd68c142f789.htm
---
# AssetPropertyDoubleArray2d Methods

Adds a new connected asset attached to this asset property, if it allows it.